tests/example/multi/wrk_cat
Running 5s test @ http://google.fr
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.56ms   12.92ms 140.67ms   94.64%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.55ms
 75.000%   28.43ms
 90.000%   32.83ms
 99.000%  109.50ms
 99.900%  133.50ms
 99.990%  140.80ms
 99.999%  140.80ms
100.000%  140.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      25.039     0.000000            1         1.00
      26.303     0.100000          153         1.11
      26.703     0.200000          299         1.25
      27.007     0.300000          450         1.43
      27.279     0.400000          604         1.67
      27.551     0.500000          748         2.00
      27.695     0.550000          829         2.22
      27.823     0.600000          896         2.50
      27.983     0.650000          975         2.86
      28.175     0.700000         1049         3.33
      28.431     0.750000         1121         4.00
      28.607     0.775000         1158         4.44
      28.815     0.800000         1197         5.00
      29.119     0.825000         1232         5.71
      29.583     0.850000         1270         6.67
      30.879     0.875000         1307         8.00
      31.471     0.887500         1326         8.89
      32.831     0.900000         1345        10.00
      34.175     0.912500         1364        11.43
      35.935     0.925000         1382        13.33
      39.071     0.937500         1401        16.00
      41.855     0.943750         1410        17.78
      44.287     0.950000         1419        20.00
      45.663     0.956250         1428        22.86
      50.815     0.962500         1439        26.67
      58.495     0.968750         1447        32.00
      64.479     0.971875         1452        35.56
      72.127     0.975000         1456        40.00
      79.167     0.978125         1461        45.71
      89.279     0.981250         1466        53.33
      96.639     0.984375         1470        64.00
      99.647     0.985938         1473        71.11
     103.295     0.987500         1475        80.00
     105.663     0.989062         1477        91.43
     111.359     0.990625         1480       106.67
     115.775     0.992188         1482       128.00
     116.223     0.992969         1483       142.22
     118.911     0.993750         1484       160.00
     119.231     0.994531         1485       182.86
     121.983     0.995313         1487       213.33
     123.327     0.996094         1488       256.00
     123.327     0.996484         1488       284.44
     127.615     0.996875         1489       320.00
     127.615     0.997266         1489       365.71
     128.959     0.997656         1490       426.67
     129.919     0.998047         1491       512.00
     129.919     0.998242         1491       568.89
     129.919     0.998437         1491       640.00
     129.919     0.998633         1491       731.43
     133.503     0.998828         1492       853.33
     133.503     0.999023         1492      1024.00
     133.503     0.999121         1492      1137.78
     133.503     0.999219         1492      1280.00
     133.503     0.999316         1492      1462.86
     140.799     0.999414         1493      1706.67
     140.799     1.000000         1493          inf
#[Mean    =       30.559, StdDeviation   =       12.921]
#[Max     =      140.672, Total count    =         1493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1495 requests in 5.00s, 785.46KB read
Requests/sec:    1
Transfer/sec:    156.95KB
Running 5s test @ http://google.fr
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.56ms   12.92ms 140.67ms   94.64%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   27.55ms
 75.000%   28.43ms
 90.000%   32.83ms
 99.000%  109.50ms
 99.900%  133.50ms
 99.990%  140.80ms
 99.999%  140.80ms
100.000%  140.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      25.039     0.000000            1         1.00
      26.303     0.100000          153         1.11
      26.703     0.200000          299         1.25
      27.007     0.300000          450         1.43
      27.279     0.400000          604         1.67
      27.551     0.500000          748         2.00
      27.695     0.550000          829         2.22
      27.823     0.600000          896         2.50
      27.983     0.650000          975         2.86
      28.175     0.700000         1049         3.33
      28.431     0.750000         1121         4.00
      28.607     0.775000         1158         4.44
      28.815     0.800000         1197         5.00
      29.119     0.825000         1232         5.71
      29.583     0.850000         1270         6.67
      30.879     0.875000         1307         8.00
      31.471     0.887500         1326         8.89
      32.831     0.900000         1345        10.00
      34.175     0.912500         1364        11.43
      35.935     0.925000         1382        13.33
      39.071     0.937500         1401        16.00
      41.855     0.943750         1410        17.78
      44.287     0.950000         1419        20.00
      45.663     0.956250         1428        22.86
      50.815     0.962500         1439        26.67
      58.495     0.968750         1447        32.00
      64.479     0.971875         1452        35.56
      72.127     0.975000         1456        40.00
      79.167     0.978125         1461        45.71
      89.279     0.981250         1466        53.33
      96.639     0.984375         1470        64.00
      99.647     0.985938         1473        71.11
     103.295     0.987500         1475        80.00
     105.663     0.989062         1477        91.43
     111.359     0.990625         1480       106.67
     115.775     0.992188         1482       128.00
     116.223     0.992969         1483       142.22
     118.911     0.993750         1484       160.00
     119.231     0.994531         1485       182.86
     121.983     0.995313         1487       213.33
     123.327     0.996094         1488       256.00
     123.327     0.996484         1488       284.44
     127.615     0.996875         1489       320.00
     127.615     0.997266         1489       365.71
     128.959     0.997656         1490       426.67
     129.919     0.998047         1491       512.00
     129.919     0.998242         1491       568.89
     129.919     0.998437         1491       640.00
     129.919     0.998633         1491       731.43
     133.503     0.998828         1492       853.33
     133.503     0.999023         1492      1024.00
     133.503     0.999121         1492      1137.78
     133.503     0.999219         1492      1280.00
     133.503     0.999316         1492      1462.86
     140.799     0.999414         1493      1706.67
     140.799     1.000000         1493          inf
#[Mean    =       30.559, StdDeviation   =       12.921]
#[Max     =      140.672, Total count    =         1493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1495 requests in 5.00s, 785.46KB read
Requests/sec:    2
Transfer/sec:    156.95KB